# 除法運算
# 設兩個數字a與b (a < b)，算出a/b的十位小數(可除盡就都為0)。
# 試計算2/7，答案為: 0.2857142857。

# 提醒:
# 1. 計算時需補0，也就是使用一般除法，2後面多補一個0，具*10的概念。
# 2. 取商(//)
# 3. 取餘(%)

a, b = 7, 13
# 第二輪計算(i = 1): 此時經過第一輪計算(i = 0)，a被取代 = 6，b不變
# 第三輪計算(i = 2): 此時經過第二輪計算(i = 1)，a被取代 = 4，b不變
# 第四輪計算(i = 3): 此時經過第三輪計算(i = 2)，a被取代 = 5，b不變
# 以此類推...

ans = "0."
i = 0
while i < 10:
    dividend = a * 10
    # 第一輪計算(i = 0): 設被除數為dividend，dividend做補0的動作 = 2 * 10 = 20
    # 第二輪計算(i = 1): 此時經過第一輪計算(i = 0)，a被取代 = 6，dividend做補0的動作 = 6 * 10 = 60
    # 第三輪計算(i = 2): 此時經過第二輪計算(i = 1)，a被取代 = 4，dividend做補0的動作 = 4 * 10 = 40
    # 以此類推...

    ans = ans + str(dividend // b)
    # 第一輪計算(i = 0): 取商，str(dividend // b) = 2，ans被取代為"0." + "2" = "0.2"
    # 第二輪計算(i = 1): 此時經過第一輪計算(i = 0)，取商，dividend = 60，str(dividend // b) = 8；ans = "0.2" + "8" = "0.28"
    # 第三輪計算(i = 2): 此時經過第一輪計算(i = 1)，取商，dividend = 40，str(dividend // b) = 5；ans = "0.28" + "5" = "0.285"
    # 以此類推...

    a = dividend % b
    # 第一輪計算(i = 0): 取餘，此時的a = 20 % 7 = 6
    # 第二輪計算(i = 1): 此時經過第一輪計算(i = 0)，取餘，此時的a = 60 % 7 = 4
    # 第二輪計算(i = 2): 此時經過第二輪計算(i = 1)，取餘，此時的a = 40 % 7 = 5
    # 以此類推...

    print(ans)
    # 第一輪計算(i = 0): 印出ans = "0.2"
    # 第二輪計算(i = 1): 印出ans = "0.28"
    # 第三輪計算(i = 2): 印出ans = "0.285"
    # 以此類推...

    i += 1